        01  A.     
        02  B    PIC S99.
        02  C    PIC S9(5)V99.
        02  D    PIC S9999 OCCURS 1 TO 52 TIMES
            DEPENDING ON B OF A.
        