       IDENTIFICATION DIVISION.
       PROGRAM-ID. test1.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NAME1 PIC X(16).
           03 COPY IDMS COPY022.
       PROCEDURE DIVISION.
           DISPLAY NOT_EXISTING.
