       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. MIN.
       PROCEDURE DIVISION.
           DISPLAY "MAIN".
           COPY IDMS COPY020_IDMSCB.
           DISPLAY NOT_EXISTING.
      *https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */8f42f475c3824e9eaf1fdd0ecd5b133aada8c304/server/dialect-idms/src/test
      */java/org/eclipse/lsp/cobol/dialects/idms/usecases
      */TestIdmsCopybookWithCobol.java