       IDENTIFICATION DIVISION.
       PROGRAM-ID. IDMS-DIAGNOSTICS-COPYBOOK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           COPY IDMS IDMS-DIAGNOSTICS-COPY.
           STOP RUN.
      * Java usecase for TRANSFER validation:
      * https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */development/server/dialect-idms/src/test/java/org/eclipse/lsp/cobol
      */dialects/idms/usecases/TestIdmsTransferStatement.java
