       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOGICAL-RECORDS-006.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           COPY IDMS LOGICAL-RECORD-STATEMENTS.
           DISPLAY NOT-EXISTING.
           STOP RUN.
      * Java usecase:
      * https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */development/server/dialect-idms/src/test/java/org/eclipse/lsp/cobol
      */dialects/idms/usecases/TestObtainLRStatement.java
