       IDENTIFICATION DIVISION.
       PROGRAM-ID. STATEMENTS-005.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           COPY IDMS STATEMENTS005-COPY.
           DISPLAY NOT-EXISTING.
           STOP RUN.
