0      IDENTIFICATION DIVISION.
1      PROGRAM-ID. TESTREPL.
2      DATA DIVISION.
3      WORKING-STORAGE SECTION.
       copy DIAGNOS REPLACING ==:baaaaa:== by x.
8      PROCEDURE DIVISION.
9          MOVE 0 TO x.
