       IDENTIFICATION DIVISION.    
       PROGRAM-ID. ABCDEF.        
       DATA DIVISION.              
       WORKING-STORAGE SECTION.    
       01 PARENT. COPY AST.

       PROCEDURE DIVISION.
       MAINLINE.                   
                 MOVE 00 TO CHILD99 OF PARENT.
       GOBACK.
