000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.            VARIABLES.
000030 ENVIRONMENT DIVISION.
000040 CONFIGURATION SECTION.
000060 INPUT-OUTPUT SECTION.
000070 FILE-CONTROsL.