       IDENTIFICATION DIVISION. 
       PROGRAM-ID. test1. 
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 WS-AREA. 
          03 AREA-XW1. 
            05 DET001-XW1. 
              07 FILLER               PIC X(5)    VALUE 'REMBD'. 
       PROCEDURE DIVISION. 
           SHOW INFO 002. 
           SHOW STD INFO 002. 
           SHOW INFO 002 DET001-XW1. 
           SHOW STD INFO 002 DET001-XW1. 
           SHOW INFO 002 DET001-XW1 DET001-XW1. 
           SHOW STD INFO 002 DET001-XW1 DET001-XW1. 
           SHOW INFO 002 DET001-XW1 DET001-XW1 DET001-XW1. 
           SHOW STD INFO 002 DET001-XW1 DET001-XW1 DET001-XW1. 
           SHOW INFO 002 'VRZMAS NOT EXIST'. 
           SHOW STD INFO 002 'VRZMAS NOT EXIST'. 
           SHOW INFO 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST'. 
           SHOW STD INFO 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST'. 
           SHOW INFO 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST' 
           'VRZMAS NOT EXIST'. 
           SHOW STD INFO 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST' 
           'VRZMAS NOT EXIST'. 
           SHOW WARNING 002. 
           SHOW STD WARNING 002. 
           SHOW WARNING 002 DET001-XW1. 
           SHOW STD WARNING 002 DET001-XW1. 
           SHOW WARNING 002 DET001-XW1 DET001-XW1. 
           SHOW STD WARNING 002 DET001-XW1 DET001-XW1. 
           SHOW WARNING 002 DET001-XW1 DET001-XW1 DET001-XW1. 
           SHOW STD WARNING 002 DET001-XW1 DET001-XW1 DET001-XW1. 
           SHOW WARNING 002 'VRZMAS NOT EXIST'. 
           SHOW STD WARNING 002 'VRZMAS NOT EXIST'. 
           SHOW WARNING 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST'. 
           SHOW STD WARNING 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST'. 
           SHOW WARNING 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST' 
            'VRZMAS NOT EXIST'. 
           SHOW STD WARNING 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST' 
            'VRZMAS NOT EXIST'. 
           SHOW ERROR 002. 
           SHOW STD ERROR 002. 
           SHOW ERROR 002 DET001-XW1. 
           SHOW STD ERROR 002 DET001-XW1. 
           SHOW ERROR 002 DET001-XW1 DET001-XW1. 
           SHOW STD ERROR 002 DET001-XW1 DET001-XW1. 
           SHOW ERROR 002 DET001-XW1 DET001-XW1 DET001-XW1. 
           SHOW STD ERROR 002 DET001-XW1 DET001-XW1 DET001-XW1. 
           SHOW ERROR 002 'VRZMAS NOT EXIST'. 
           SHOW STD ERROR 002 'VRZMAS NOT EXIST'. 
           SHOW ERROR 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST'. 
           SHOW STD ERROR 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST'. 
           SHOW ERROR 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST' 
           'VRZMAS NOT EXIST'. 
           SHOW STD ERROR 002 'VRZMAS NOT EXIST' 'VRZMAS NOT EXIST' 
           'VRZMAS NOT EXIST'. 
      * Negative tests      
           SHOW INFO 00. 
           SHOW STD INFO 00. 
           SHOW WARNING 00. 
           SHOW STD WARNING 00. 
           SHOW ERROR 00. 
           SHOW STD ERROR 00. 
           SHOW INFO 0012. 
           SHOW STD INFO 0012. 
           SHOW WARNING 0012. 
           SHOW STD WARNING 0012. 
           SHOW ERROR 0012. 
           SHOW STD ERROR 0012. 
           SHOW INFO 002 ASD. 
           SHOW STD INFO 002 ASD. 
           SHOW WARNING 002 ASD. 
           SHOW STD WARNING 002 ASD. 
           SHOW ERROR 002 ASD. 
           SHOW STD ERROR 002 ASD. 
           SHOW INFO 002 DET001-XW1 ASD. 
           SHOW STD INFO 002 DET001-XW1 ASD. 
           SHOW WARNING 002 DET001-XW1 ASD. 
           SHOW STD WARNING 002 DET001-XW1 ASD. 
           SHOW ERROR 002 DET001-XW1 ASD. 
           SHOW STD ERROR 002 DET001-XW1 ASD. 
           SHOW INFO 002 DET001-XW1 DET001-XW1 ASD. 
           SHOW STD INFO 002 DET001-XW1 DET001-XW1 ASD. 
           SHOW WARNING 002 DET001-XW1 DET001-XW1 ASD. 
           SHOW STD WARNING 002 DET001-XW1 DET001-XW1 ASD. 
           SHOW ERROR 002 DET001-XW1 DET001-XW1 ASD. 
           SHOW STD ERROR 002 DET001-XW1 DET001-XW1 ASD. 
      * https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */40bec9e7654f1e5d8c086e188a170dc4205fdc1f/server/dialect-daco/src/test
      */java/org/eclipse/lsp/cobol/dialects/daco/usecases
      */TestDaCoShowMessageStatement.java