       IDENTIFICATION DIVISION. 
       PROGRAM-ID. test1. 
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION. 
       WORKING-STORAGE SECTION.
       01 ERROR-STATUS.
006800       05 FILLER                 PIC 9(01)   VALUE ZERO.            D0009A
006900         88 NO-BOOKING-ON-LAST-LOCATION      VALUE 0.               D
007000         88 BOOKING-ON-LAST-LOCATION         VALUE 1.               D     
       PROCEDURE DIVISION.
           DISPLAY NOT_EXISTING.
