000200 IDENTIFICATION DIVISION. 
000300 PROGRAM-ID.    BMDPMF3M.
001700 DATA   DIVISION.
001800 WORKING-STORAGE SECTION.
001900 01  WS-AREA.
003200     03 AREA-XW3.
003500       05 TBLCUR-XW3 COPY-FROM W4.
006000     03 AREA-XW4.
008900       05 TBLCUR-XW4.
009100         07 ROWCUR-XW4                       OCCURS 2500.
009900           09 LSTPRYOPT-BW4      PIC S9(7)V9(2)
010000                                             VALUE ZERO  COMP.
