       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TEST1.
       PROCEDURE DIVISION.
       FOO.
           READ TRANSACTION
           GO TO FOO.
           DISPLAY NOT_EXISTING.

      *https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */40bec9e7654f1e5d8c086e188a170dc4205fdc1f/server/dialect-daco/src/test
      */java/org/eclipse/lsp/cobol/dialects/daco/usecases
      */TestDaCoReadTransaction.java