       IDENTIFICATION DIVISION. 
       PROGRAM-ID. test1. 
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01  TBLNAM-XAA PIC X(6).
       01  AREA-XAA.
           03 TBLNAM-XBB COPY-FROM AA.
       PROCEDURE DIVISION.
           MOVE 6 to RUSNAM-BBB.
           DISPLAY NOT_EXISTING.
