1      IDENTIFICATION DIVISION.
2      PROGRAM-ID.    CPFTC.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
            PROTOCOL. MODE ABC.
            IDMS-RECORDS MANUAL
3      DATA   DIVISION.
4      WORKING-STORAGE SECTION.
5      01 ROOT.
6          05 NODE1 COPY-FROM W4.
      * https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */8f42f475c3824e9eaf1fdd0ecd5b133aada8c304/server/dialect-daco/src/test
      */java/org/eclipse/lsp/cobol/dialects/daco/usecases/TestDaCoCopyFrom5.java