        IDENTIFICATION DIVISION.
        PROGRAM-ID. PARTEST.
        ENVIRONMENT DIVISION.
        IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
        DATA DIVISION.
        WORKING-STORAGE SECTION.
            01 COPY MAID TEST-AA12.
        PROCEDURE DIVISION.
            STOP RUN. 
