       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TEST1.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PARENT.
           03 AREA-XW7.
             05 BHTREG-XWX OCCURS 50.
               07 COPY MAID DACO04-XBG WRK.
       PROCEDURE DIVISION.
           DISPLAY NOT_EXISTING.           