       IDENTIFICATION DIVISION. 
       PROGRAM-ID. test1. 
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION. 
       WORKING-STORAGE SECTION.
       01 AREA-XW4.
           02  COPY MAID PMOREC WRK
       PROCEDURE DIVISION.
           MOVE 6 to ITEAVL-XW4.
           DISPLAY NOT_EXISTING.
