       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTEST.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 COPY MAID DACO01-A12.
       PROCEDURE DIVISION.
           DISPLAY ABC.
           DISPLAY NOT_EXISTING.
           STOP RUN.  
