       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TEST1.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01  COPY IDMS SUBSCHEMA-NAMES.
       PROCEDURE DIVISION.
           DISPLAY NOT_EXISTING.
