       IDENTIFICATION DIVISION.
       PROGRAM-ID. test1.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-AREA.
          03 AREA-XW1.
            05 DET001-XW1.
              07 FILLER               PIC X(5)    VALUE 'REMBD'.
       PROCEDURE DIVISION.
           WRITE REPORT FROM DET001-XW1.
           WRITE REPORT FROM DET001-XW1 AFTER 85 LINES.
           WRITE REPORT FROM DET001-XW1 AFTER 1 LINE.
           WRITE REPORT FROM DET001-XW1 AFTER PAGE.
           WRITE REPORT FROM DET001-XW1 AFTER DET001-XW1.
           WRITE REPORT FROM DET001-XW1 LENGTH 80
                 AFTER DET001-XW1.
           WRITE REPORT TGD11 FROM DET001-XW1.
           WRITE REPORT FROM DET001-XW1.
           WRITE REPORT RGD11 FROM DET001-XW1 AFTER 85 LINES.
           WRITE REPORT RGD11 FROM DET001-XW1 AFTER 1 LINE.
           WRITE REPORT RGD11 FROM DET001-XW1 AFTER PAGE.
           WRITE REPORT RGD11 FROM DET001-XW1 AFTER DET001-XW1.
           WRITE REPORT RGD11 FROM DET001-XW1 LENGTH 80
                 AFTER DET001-XW1.
           WRITE REPORT RGD11 FROM DET001-XW1 LENGTH 80.
           WRITE REPORT RGD11 FROM DET001-XW1 LENGTH 80 AFTER PAGE.
           WRITE REPORT RGD11 FROM DET001-XW1 LENGTH 80 AFTER 20 LINES.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1 AFTER PAGE.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1
                 AFTER 20 LINES.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1
                 AFTER DET001-XW1.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1 LENGTH 80.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1 LENGTH 80
                 AFTER PAGE.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1 LENGTH 80
                 AFTER 20 LINES.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1 LENGTH 80
                 AFTER DET001-XW1.
      * Negative tests
           WRITE REPORT R-CA FROM DET001-XW1.
           WRITE REPORT RFDRGR FROM DET001-XW1.
           WRITE REPORT STDFE FROM DET001-XW1.
           WRITE REPORT RTDFE FROM DET001-XW1 LENGTH 75.
           WRITE REPORT RTDFE FROM DET001-XW1 LENGTH 205.
           WRITE REPORT RGD11 FROM DET001-XW1 TO ASD.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1 LENGTH 75.
           WRITE REPORT RGD11 FROM DET001-XW1 TO DET001-XW1 LENGTH 205.
           
           WRITE REPORT RGD11 FROM DET001-XW1 TO ASD LENGTH 205.
           WRITE REPORT RGD11 FROM DET001-XW1 AFTER ASD.
           WRITE REPORT RGD11 FROM DET001-XW1 TO ASD LENGTH 205
                 AFTER ASD.
      *https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */40bec9e7654f1e5d8c086e188a170dc4205fdc1f/server/dialect-daco/src/test
      */java/org/eclipse/lsp/cobol/dialects/daco/usecases
      */TestDaCoWriteReportWithName.java