       IDENTIFICATION DIVISION. 
       PROGRAM-ID. test1. 
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01  COPY MAID PMOREC.
       01  VAR1.
           03 VAR1_CHILD1 PIC 9.
       01  COPY MAID TEPTRA-XTT.
       PROCEDURE DIVISION. 
           MOVE 6 to OPDATOINI-XII.
