       IDENTIFICATION DIVISION. 
       PROGRAM-ID. test1. 
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01  COPY MAID TBLEXPAND WRK.
       PROCEDURE DIVISION.
           MOVE 6 to RUSNAM-BAA.
           DISPLAY NOT_EXISTING.
