       IDENTIFICATION DIVISION.
       PROGRAM-ID. test1.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TRANSACTION-SIZE PIC 9(5).
       01 FDERESS4342 PIC 9(5).
       01 SDFERTSFERTSQAWED5GHT PIC 9(5).
       PROCEDURE DIVISION.
           WRITE TRANSACTION INPUT.
           WRITE TRANSACTION PIBV.
           WRITE TRANSACTION OSD2.
           WRITE TRANSACTION 3167
           WRITE TRANSACTION 3167 LENGTH 4.
           WRITE TRANSACTION INPUT LENGTH 4.
           WRITE TRANSACTION 3167 LENGTH 2048.
           WRITE TRANSACTION INPUT LENGTH 2048.
           WRITE TRANSACTION 3167 LENGTH TRANSACTION-SIZE.
           WRITE TRANSACTION 3167 LENGTH 2048 TO FDERESS4342.
           WRITE TRANSACTION INPUT LENGTH 2048 TO FDERESS4342.
      * Negative Tests
           WRITE TRANSACTION R-DS.
           WRITE TRANSACTION RD.
           WRITE TRANSACTION RDERW.
           WRITE TRANSACTION 3167 LENGTH 3.
           WRITE TRANSACTION INPUT LENGTH 3.
           WRITE TRANSACTION 3167 LENGTH 2049.
           WRITE TRANSACTION INPUT LENGTH 2049.
           WRITE TRANSACTION 3167 LENGTH 25 TO SDFERTSFERTSQAWED5GHT.
           WRITE TRANSACTION INPUT LENGTH 25 TO SDFERTSFERTSQAWED5GHT.
           WRITE TRANSACTION INPUT TO FDERESS4342 OF NOT_EXISTING.
      *https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */40bec9e7654f1e5d8c086e188a170dc4205fdc1f/server/dialect-daco/src/test
      */java/org/eclipse/lsp/cobol/dialects/daco/usecases
      */TestDaCoWriteTransaction.java 