       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TEST1.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
           PROTOCOL. MODE ABC.
           IDMS-RECORDS MANUAL
       DATA DIVISION.
       LINKAGE SECTION.
        01 PARENT-XN1.
            05 COPY MAID DACO06-XBG WRK.
       PROCEDURE DIVISION.
           DISPLAY BHTRGL-XN1.
           DISPLAY NOT_EXISTING. 
      