000200 IDENTIFICATION DIVISION. 
000300 PROGRAM-ID.    PROG1.
001700 DATA   DIVISION.
001800 WORKING-STORAGE SECTION.
001900 01  PARENT.
003200     03 AREA-XW3.
003500       05 TBLABC-XW3 COPY-FROM W4.
006000     03 AREA-XW4.
008900       05 TBLABC-XW4.
009100         07 ROWABC-XW4                       OCCURS 2500.
009900           09 ABCDEF-BW4      PIC S9(7)V9(2)
010000                                             VALUE ZERO  COMP.
011000 PROCEDURE DIVISION.
012000     DISPLAY ABCDEF-BW3.
013000     DISPLAY NOT_EXISTING.
