      ******************************************************************
      *                                                                *
      * (C) Copyright IBM Corp. 2011, 2020                             *
      *                                                                *
      ******************************************************************
       01 REQUEST.
           03 CA-REQUEST-ID PIC X(6).
           03 CA-CUSTOMER-NUM PIC 9(10) DISPLAY.
           03 CA-REQUEST-SPECIFIC PIC X(32482).
