      ******************************************************************
      *                                                                *
      * (C) Copyright IBM Corp. 2011, 2020                             *
      *                                                                *
      ******************************************************************
       01  COMMA-DATA.
           03 Comma-Data-Text        Pic X(14).
           03 Comma-Data-High        Pic X(10).
           03 FILLER                 Pic X(48).
