      ******************************************************************
      *                                                                *
      * (C) Copyright IBM Corp. 2011, 2020                             *
      *                                                                *
      ******************************************************************
       01  COMMA-DATA.
         03  Customer-Number          Pic X(10).
         03  Filler                   Pic X(72).
