      ******************************************************************
      *                                                                *
      * (C) Copyright IBM Corp. 2011, 2020                             *
      *                                                                *
      ******************************************************************
      ******************************************************************
      *             M&A Scenario - Lord General Insurance Co.          *
      *                                                                *
      *               COPYBOOK for COMMAREA structure                  *
      *                                                                *
      *     Get valid policy number input comm area                    *
      ******************************************************************
       01  COMMA-DATA.
           03  Type             Pic X.
           03  Cust-Num         Pic 9(10).
           03  FILLER           Pic X(79).
