       01  ITEAVL-XIA.
           03 TBLKNM-XIA.
             05 ROWKNM-XIA                         OCCURS 15.
               07 SPETPS-XIA           PIC X.
