     1 01  POLCRI-XRI.                                                      80
     2     03 VLGNUM-BRI               PIC S9(4)   VALUE ZERO  COMP.         1
     3     03 BPKKRIKOD-XRI            PIC X(3)    VALUE SPACE.              3
     4     03 OPTTPSKOD-XRI            PIC X       VALUE SPACE.              6
    16     03 F02-XRI REDEFINES OPTTPSKOD-XRI.                               7
