      *
      *
      *
      * The userinvokes this transaction (called MRBC) via:
      *   MRBC <VERB>
      *
      * Where:
      * The user invokes this transaction  (called MRBC) via|
      *
      * Verb Functions:
      * CREate
      *  Invoked via MRBC CRE <COLOR> <INVENTORY> <COST>
      *
      *  Where:
      *   <COLOR> Exists in the EVENT.COLOR table.
      *   <INVENTORY> An integer value.
      *   <COST> An integer value.
      *
      *  Errors:
      *   MRBC002E - When a marble of <COLOR> already exists in the table
      *
      *  Example:
      *   MRBC CRE BLUE 10 4
      *
      * UPDate
      *  Invoked via MRBC UPD <COLOR> <INVENTORY> <COST>
      *
      *  Where:
      *   <COLOR> Is a color of an existing marble.
      *   <INVENTORY> An integer value.
      *   <COST> An integer value.
      *
      *  Errors:
      *   MRBC001E - When a marble of <COLOR> doesn't exist in the table
      *
      *  Example:
      *   MRBC UPD BLUE 1 5
      *
      * DELete
      *  Invoked via MRBC DEL <COLOR>
      *
      *  Where:
      *   <COLOR> Is a color of an existing marble.
      *
      *  Errors:
      *   MRBC001E - When a marble of <COLOR> doesn't exist in the table
      *
      *  Example:
      *   MRBC DEL BLUE
      *
      * Build via
      *  gulp build --source marbles.cbl && gulp refresh --source marbles.cbl
      * ===============================================================
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MARBLESC .
       ENVIRONMENT DIVISION.
       DATA DIVISION.
      * ===============================================================
      * Map input / output areas
      * ===============================================================
       WORKING-STORAGE SECTION.
       01 BOOLEAN.
          02 BOOLEAN-FALSE PIC 9 VALUE 0.
          02 BOOLEAN-TRUE PIC 9 VALUE 1.
       01 WS-WORK.
          02 WS-WORK-INV PIC S9(4) COMP VALUE 0.
          02 WS-WORK-COST PIC S9(4) COMP VALUE 0.
          02 WS-WORK-COLOR PIC X(10).
          02 WS-WORK-ROW-COUNT PIC S9(4) COMP-3 VALUE 0.
       01 WS-RESULT.
          02 WS-RESULT-COLOR-FOUND PIC 9 VALUE 0.
          02 WS-RESULT-OPERATION-SUCCESS PIC 9 VALUE 0.
          02 WS-RESULT-VERB.
             03 WS-RESULT-VERB-CREATE PIC 9 VALUE 0.
             03 WS-RESULT-VERB-UPDATE PIC 9 VALUE 0.
             03 WS-RESULT-VERB-DELETE PIC 9 VALUE 0.
       01 WS-CONST.
          02 WS-CONST-CREATE PIC X(3) VALUE 'CRE'.
          02 WS-CONST-UPDATE PIC X(3) VALUE 'UPD'.
          02 WS-CONST-DELETE PIC X(3) VALUE 'DEL'.
          02 WS-CONST-SUCCESS PIC X(7) VALUE 'SUCCESS'.
       01 WS-ERROR-CODES.
          02 WS-ERROR-MARBLE-DNE PIC X(8) VALUE 'MRBC001E'.
          02 WS-ERROR-MARBLE-EXISTS PIC X(8) VALUE 'MRBC002E'.
       01 WS-CICS-INPUT PIC X(74) VALUE SPACES.
       01 WS-INPUT.
          05 WS-INPUT-TRAN-ID PIC X(4).
          05 WS-INPUT-VERB PIC X(3) VALUE SPACES.
          05 WS-INPUT-COLOR PIC X(10) VALUE SPACES.
          05 WS-INPUT-INV PIC 9(4) VALUE 0.
          05 WS-INPUT-COST PIC 9(4) VALUE 0.
       01 WS-OUTPUT PIC X(78).
       01 WS-OUTPUT-SUCCESS REDEFINES WS-OUTPUT.
          05 WS-OUTPUT-SUCCESS-TEXT PIC X(7).
          05 WS-OUTPUT-SUCCESS-FILLER PIC X(71).
       01 WS-OUTPUT-ERROR REDEFINES WS-OUTPUT.
          05 WS-OUTPUT-ERROR-CODE PIC X(8).
          05 WS-OUTPUT-ERROR-SPACE PIC X(1).
          05 WS-OUTPUT-ERROR-MESSAGE PIC X(69).
       01 WS-MSG-LENGTH PIC S9(4) COMP.
      * ===============================================================
      * Map SQL table for this transaction
      * ===============================================================
           EXEC SQL DECLARE EVENT.MARBLE TABLE
           ( COLOR                          VARCHAR(10) NOT NULL,
             INVENTORY                      INTEGER NOT NULL,
             COST                           INTEGER NOT NULL
           ) END-EXEC.
           EXEC SQL INCLUDE SQLCA END-EXEC.
      * ===============================================================
      * MRBL transaction
      * ===============================================================
       PROCEDURE DIVISION.