       IDENTIFICATION DIVISION.
       FUNCTION-ID. FUNC1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
        FILE SECTION.
        WORKING-STORAGE SECTION.
        LINKAGE SECTION.
        01 A PIC X.
       PROCEDURE DIVISION returning A.
           MOVE FUNCTION FUNC1 TO A.
       END FUNCTION FUNC1.
             