        IDENTIFICATION DIVISION. 
        PROGRAM-ID. test1.
        ENVIRONMENT DIVISION.
        IDMS-CONTROL SECTION.
            PROTOCOL. 
            SUBSCHEMA-NAMES LENGTH IS 17
            IDMS-RECORDS WITHIN WORKING-STORAGE LEVELS INCREMENTED 18.
      * Java usecase:
      * https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */development/server/dialect-idms/src/test/java/org/eclipse/lsp/cobol
      */dialects/idms/usecases/TestIdmsControlSectionAll.java
