        IDENTIFICATION DIVISION.
        PROGRAM-ID. test1.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        SCHEMA SECTION.
            DB EMPSS012X WITHIN EMPSCHMXX.
        MAP SECTION.
        MAX FIELD LIST IS 12 
        MAP MAP1TOOLONG TYPE IS EXTENDED PAGING.
        MAP MAP2
        MAP MAP3 TYPE STANDARD.
      * Java usecase:
      * https://github.com/eclipse-che4z/che-che4z-lsp-for-cobol/blob
      */development/server/dialect-idms/src/test/java/org/eclipse/lsp/cobol
      */dialects/idms/usecases/TestIdmsSections.java
