       COPY COPYBOOK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. mainfile1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
        FILE SECTION.
        WORKING-STORAGE SECTION.
        01 A PIC X.
        LINKAGE SECTION.
       PROCEDURE DIVISION.
        MAIN-PROCESSING SECTION.
         MAINLINE-PARAGRAPH.
            MOVE FUNCTION FUNC1 to A.
             
             STOP RUN.