000000 Identification Division.                                         00000000
000000 Program-ID.                                                      00000000
000000  HELLOWORLD.                                                     00000000
000800**     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.                CM1014.2
002000 SECURITY.                                                        CM1014.2
002100     NONE.                                                        CM1014.2
000000 Procedure Division.                                              00000000
000000  Display "Hello world"                                          00000000
000000  STOP RUN.                                                       00000000