**WWW**    * ----------------------------------------------------------*
     1 01  PDRTPY-DXY.                                                     320
     2     03 ERGTVYMDK-DXY.                                                 1
     3       05 DMQSXREF-DXY.                                                1
     4         07 QSXREF-DXY.                                                1
     9           09 PARTYLEV-DXY       PIC X       OCCURS 3.                13
    11         07 UMSGAL-DRT           PIC S9(6)   VALUE ZERO  COMP.        20
    15       05 RIXBADJETWOL-DXY       PIC X       VALUE SPACE.             46
    31       05 FILLER                 PIC X(10)   VALUE SPACE.            110
    36       05 OTKYTN-DXY             PIC X       VALUE 'N'.              138
    37       05 FILLER                 PIC X(2)    VALUE SPACE.            139
    40     03 JHTSDRQYTLKE-DXY         PIC X       VALUE SPACE.            143
    41     03 FILLER                   PIC X(9)    VALUE SPACE.            144
    42     03 KJXQXZVCO-DRT            PIC S9(8)   VALUE ZERO  COMP.       153
    46     03 FILLER                   PIC X       VALUE SPACE.            179
    51     03 HYYTFXQOS-DRT            PIC S9(5)   VALUE ZERO  COMP.       193
    52     03 FILLER                   PIC X(92)   VALUE SPACE.            197
    53     03 XJYFYD-DXY.                                                  289
    54       05 NZWJXQ-DRT             PIC S9(8)   VALUE ZERO  COMP.       289
    57     03 WYZGEG-DXY.                                                  305
    58       05 TQXHFD-DRT             PIC S9(8)   VALUE ZERO  COMP.       305
