      * BOOK2 Test
       01 BOOK1N-REC.

       Data Division.
       Working-Storage Section.
           05 User-Phone-Mobile PIC 9(6).
      *     06 User-Phone-Mobile1 PIC 9(6).
