      * Copyright (c) 2023 Broadcom.
      * The term "Broadcom" refers to Broadcom Inc. and/or its subsidiaries.
      *
      * This program and the accompanying materials are made
      * available under the terms of the Eclipse Public License 2.0
      * which is available at https://www.eclipse.org/legal/epl-2.0/
      *
      * SPDX-License-Identifier: EPL-2.0
      *
      * Contributors:
      *    Broadcom, Inc. - initial API and implementation
      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLOSEPAR.
       PROCEDURE DIVISION.
           PERFORM BP OF SEC1 THRU EP OF SEC2.
       SEC1 SECTION.
       BP.
           DISPLAY 'BP'.
       CP.
           DISPLAY 'CP'.
       SEC2 SECTION.
       EP.
           DISPLAY 'EP'.