       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST1.
       PROCEDURE DIVISION.
           ALTER PAR1 OF SEC1 TO PROCEED TO PAR2.
       SEC1 SECTION.
       PAR1.
       PAR2.
