        IDENTIFICATION DIVISION.
        PROGRAM-ID.    CBACT01C.
        PROCEDURE DIVISION.
           EXEC CICS HANDLE ABEND
           END-EXEC.
.
