       IDENTIFICATION DIVISION.
       PROGRAM-ID. HLLOWRLD.
       DATA DIVISION. 

       PROCEDURE DIVISION.
           PERFORM B THRU P.
           STOP RUN.
       A SECTION.
           DISPLAY 'A'.
       B SECTION.
           DISPLAY 'B'.
           EXIT SECTION.
       C.
           DISPLAY 'C'.
       D.
           DISPLAY 'D'.
       E SECTION.
           DISPLAY 'E'.
       P.
           DISPLAY 'P'.
       X.
           DISPLAY 'X'.
