       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID. HLLOWRLD.                                                    
       PROCEDURE DIVISION.
           PERFORM B THRU D.
           STOP RUN.
       A.
       B.
       C.
           PERFORM X.
       D.
       E.
           DISPLAY "E".
                                                                                
       X.
           DISPLAY "X".
