       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG.
       PROCEDURE DIVISION.
           GO TO PAR1.
       SEC1.
           DISPLAY "SEC1".
       PAR1.
           DISPLAY "PAR1".
           EXIT SECTION.
       PAR2.
           DISPLAY "PAR2".