       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID. HLLOWRLD.                                                    
                                                                                
       PROCEDURE DIVISION.
           PERFORM A.
           EXIT.
           PERFORM B.
           STOP RUN.
       A.
           DISPLAY "A".
           EXIT.
       B.
           DISPLAY "B".
           EXIT.

