       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PROG.
       PROCEDURE DIVISION.
           EXEC CICS HANDLE ABEND LABEL(HANDLE-ABEND) END-EXEC
           GO TO CALCULATION.

       CALCULATION.
           EXEC CICS RETURN END-EXEC.
           GOBACK.

       HANDLE-ABEND.
           DISPLAY "HANDLE ABEND".
           GOBACK.