       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM1 PIC 9(9).
       PROCEDURE DIVISION.

       PAR0.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR1.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR2.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR3.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.
           
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR4.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.
           
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR5.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.
           
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR6.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR7.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.

       PAR8.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR9
           END-IF.
           
       PAR9.
           IF (WS-NUM1 > 1) THEN
               PERFORM PAR0
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR1
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR2
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR3
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR4
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR5
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR6
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR7
           END-IF.

           IF (WS-NUM1 > 1) THEN
               PERFORM PAR8
           END-IF.
           