       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM1 PIC 9(9).
       PROCEDURE DIVISION.
           PERFORM PAR1 UNTIL WS-NUM1 IS EQUAL "A".
           PERFORM PAR2.
           STOP RUN.

       PAR1.
           DISPLAY "PAR1".

       PAR2.
           DISPLAY "PAR1".