       IDENTIFICATION DIVISION.
       PROGRAM-ID.  CFGPSQE.
       PROCEDURE DIVISION.
           DISPLAY 'OUT'.
           GO TO PARAG2.
       PARAG1.
           DISPLAY 'PARAG1'.
       PARAG2.
           DISPLAY 'PARAG2'.
           STOP RUN.
       PARAG3.
           DISPLAY 'PARAG3'.
