       IDENTIFICATION DIVISION.
       PROGRAM-ID. HLLOWRLD.
       DATA DIVISION. 

       PROCEDURE DIVISION.
           PERFORM B THRU D.
           STOP RUN.
       A.
           DISPLAY "A".
       B.
           DISPLAY "B".
           PERFORM X.
       C.
           DISPLAY "C".
       D.
           DISPLAY "D".
       E.
           DISPLAY "E".
       X.
           DISPLAY "E".

        
