       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PROG.

       PROCEDURE DIVISION.
           IF A > B
               DISPLAY "A > B"
           ELSE 
               GO TO PAR2.

       PAR1.
           GOBACK.

       PAR2.

