       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PROG.
       PROCEDURE DIVISION.
           IF A > B THEN
                    EXEC CICS HANDLE ABEND LABEL(HANDLE-ABEND) END-EXEC
                    GO TO CALCULATION 
           END-IF.

           EXEC CICS DELAY FOR MILLISECS(500) REQID(CHECK) END-EXEC.
           GOBACK.

       CALCULATION SECTION.
           EXEC CICS DELAY FOR MILLISECS(500) REQID(CHECK) END-EXEC.

       CALCULATION-END.
           GOBACK.

       HANDLE-ABEND.
           DISPLAY "HANDLE ABEND".
