       IDENTIFICATION DIVISION.
       PROGRAM-ID.      ST.
       AUTHOR.          CA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       PROCEDURE DIVISION.
           PERFORM MY1-P2.                  
       P.
           CONTINUE.
       MY1 SECTION.
           DISPLAY 'A'.
       MY1-P2.
           DISPLAY 'A'.