       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG.
       PROCEDURE DIVISION.
           PERFORM SEC1.
           STOP RUN.

       SEC1 SECTION.
           DISPLAY "SEC1".
       PAR1.
           DISPLAY "PAR1".
           EXIT SECTION.
       PAR2.
           DISPLAY "PAR2".