       IDENTIFICATION DIVISION.
       PROGRAM-ID. CASE38.
       PROCEDURE DIVISION.
           PERFORM A.
           PERFORM A.
           PERFORM B.
           STOP RUN.

       A.
           DISPLAY "A".
       B.
           DISPLAY "B".
