       IDENTIFICATION DIVISION.
       PROGRAM-ID. HLLOWRLD.
       DATA DIVISION. 

       PROCEDURE DIVISION.
           PERFORM B THRU D.
           STOP RUN.
       A SECTION.
           DISPLAY 'A'.
       B SECTION.
           DISPLAY 'B'.
       C SECTION.
           DISPLAY 'C'.
       D SECTION.
           DISPLAY 'D'.
           EXIT SECTION.
       D-A.
           DISPLAY 'D-A'.
       E SECTION.
           DISPLAY 'E'.
