       01  ACCOUNT-RECORD.
           03  ACCOUNT-KEY.
               05  ACCOUNT-ID                 PIC 9(06)  VALUE ZERO.
               05  ACCOUNT-RECORD-TYPE        PIC 9(02)  VALUE ZERO.
                   88  ACCOUNT-CONTROL        VALUE 0.
                   88  ACCOUNT-STATISTICS     VALUE 1.
                   88  ACCOUNT-MAINTENANCE    VALUE 2.
                   88  ACCOUNT-DELIVERIES     VALUE 3.
                   88  ACCOUNT-PAYMENTS       VALUE 4.
               05  ACCOUNT-RECORD-NUMBER      PIC 9(04)  VALUE ZERO.
           03  ACCOUNT-DATA                   PIC X(500) VALUE SPACE.
      *
       01  ACCOUNT-CONTROL-RECORD.
           03  A-C-KEY.
               05  A-C-ACCOUNT-ID             PIC 9(06)  VALUE ZERO.
               05  A-C-RECORD-TYPE            PIC 9(02)  VALUE ZERO.
               05  A-C-RECORD-NUMBER          PIC 9(04)  VALUE ZERO.
           03  A-C-DATA                       PIC X(500) VALUE SPACE.
           03  FILLER                         REDEFINES A-C-DATA.
               05  A-C-MIN-ACCOUNT-ID         PIC 9(04).
               05  A-C-MAX-ACCOUNT-ID         PIC 9(04).
      *
       01  ACCOUNT-STATISTICS-RECORD.
           03  A-S-KEY.
               05  A-S-ACCOUNT-ID             PIC 9(06)  VALUE ZERO.
               05  A-S-RECORD-TYPE            PIC 9(02)  VALUE 1.
               05  A-S-RECORD-NUMBER          PIC 9(04)  VALUE ZERO.
           03  A-S-DATA                       PIC X(500) VALUE SPACE.
           03  FILLER                         REDEFINES A-S-DATA.
               05  A-S-CUSTOMER-NAME.
                   07  A-S-NAME-LAST          PIC X(16).
                   07  A-S-NAME-FIRST         PIC X(16).
                   07  A-S-NAME-INITIAL       PIC X(01).
               05  A-S-ADDRESS                PIC X(64).
               05  A-S-CITY                   PIC X(24).
               05  A-S-STATE                  PIC X(02).
               05  A-S-ZIP-CODE.
                   07  A-S-ZIP                PIC 9(05).
                   07  A-S-ZIP-EX             PIC 9(04).
               05  A-S-TELEPHONE-1.
                   07  A-S-TEL-1A             PIC 9(03).
                   07  A-S-TEL-1B             PIC 9(03).
                   07  A-S-TEL-1C             PIC 9(04).
               05  A-S-TELEPHONE-2.
                   07  A-S-TEL-2A             PIC 9(03).
                   07  A-S-TEL-2B             PIC 9(03).
                   07  A-S-TEL-2C             PIC 9(04).
               05  A-S-START-OF-CONTRACT      PIC 9(06).
               05  A-S-END-OF-CONTRACT        PIC 9(06).
               05  A-S-SIZE-OF-HOME           PIC 9(04).
               05  A-S-SIZE-OF-TANK           PIC 9(04).
               05  A-S-UNIT-PRICE             PIC 9(03).
               05  A-S-ESTIMATED-USAGE        PIC 9(04).
               05  A-S-ESTIMATED-COST         PIC 9(06).
               05  A-S-BUDGET-AMOUNT          PIC 9(06).
               05  A-S-MAINTENANCE-ENTRIES    PIC 9(04).
               05  A-S-LAST-MAINTENANCE       PIC 9(06).
               05  A-S-DELIVERY-ENTRIES       PIC 9(04).
               05  A-S-LAST-DELIVERY          PIC 9(06).
               05  A-S-PAYMENT-ENTRIES        PIC 9(04).
               05  A-S-LAST-PAYMENT           PIC 9(06).
               05  A-S-BALANCE                PIC S9(06).
               05  A-S-PAYMENT-DUE            PIC 9(06).
      *
       01  ACCOUNT-MAINTENANCE-RECORD.
           03  A-M-KEY.
               05  A-M-ACCOUNT-ID             PIC 9(06)  VALUE ZERO.
               05  A-M-RECORD-TYPE            PIC 9(02)  VALUE 2.
               05  A-M-RECORD-NUMBER          PIC 9(04)  VALUE ZERO.
           03  A-M-DATA                       PIC X(500) VALUE SPACE.
           03  FILLER                         REDEFINES A-M-DATA.
               05  A-M-ENTRY                  OCCURS 10.
                   07  A-M-DATE-OF-SERVICE    PIC 9(06).
                   07  A-M-TECHNICIAN         PIC 9(04).
                   07  A-M-PROBLEM-CODE       PIC 9(04).
                   07  A-M-RESOLUTION-CODE    PIC 9(04).
                   07  A-M-PARTS-REPLACED     PIC 9(04).
                   07  A-M-PART-LIST.
                       09  A-M-PART           PIC 9(04) OCCURS 5.
                   07  A-M-SERVICE-CHARGE     PIC 9(06).
      *
       01  ACCOUNT-DELIVERY-RECORD.
           03  A-D-KEY.
               05  A-D-ACCOUNT-ID             PIC 9(06)  VALUE ZERO.
               05  A-D-RECORD-TYPE            PIC 9(02)  VALUE 3.
               05  A-D-RECORD-NUMBER          PIC 9(04)  VALUE ZERO.
           03  A-D-DATA                       PIC X(500) VALUE SPACE.
           03  FILLER                         REDEFINES A-D-DATA.
               05  A-D-ENTRY                  OCCURS 20.
                   07  A-D-DATE-OF-DELIVERY   PIC 9(06).
                   07  A-D-TECHNICIAN         PIC 9(04).
                   07  A-D-GALLONS            PIC 9(04).
                   07  A-D-UNIT-PRICE         PIC 9(03).
      *
       01  ACCOUNT-PAYMENT-RECORD.
           03  A-P-KEY.
               05  A-P-ACCOUNT-ID             PIC 9(06)  VALUE ZERO.
               05  A-P-RECORD-TYPE            PIC 9(02)  VALUE 4.
               05  A-P-RECORD-NUMBER          PIC 9(04)  VALUE ZERO.
           03  A-P-DATA                       PIC X(500) VALUE SPACE.
           03  FILLER                         REDEFINES A-P-DATA.
               05  A-P-ENTRY                  OCCURS 20.
                   07  A-P-DATE-OF-PAYMENT    PIC 9(06).
                   07  A-P-AMOUNT             PIC 9(06).
      *
       01  ACCTFILE-LENGTH                    PIC 9(04) COMP VALUE 512.
       01  ACCTFILE-KEYLENGTH                 PIC 9(04) COMP VALUE 12.
       01  ACCTFILE-RESP                      PIC 9(08) COMP VALUE ZERO.
       01  ACCTFILE-RESP2                     PIC 9(08) COMP VALUE ZERO.
      *
