      *****************************************************************         
      *    Data-structure for transaction type (RECLN = 60)                     
      *****************************************************************         
       01  TRAN-TYPE-RECORD.                                                    
           05  TRAN-TYPE                               PIC X(02).               
           05  TRAN-TYPE-DESC                          PIC X(50).               
           05  FILLER                                  PIC X(08).               
      *
      * Ver: CardDemo_v1.0-15-g27d6c6f-68 Date: 2022-07-19 23:16:00 CDT
      *
