       01 UNUSED-DATA.
         05 UNUSED-ID                 PIC X(08).
         05 UNUSED-FNAME              PIC X(20).
         05 UNUSED-LNAME              PIC X(20).
         05 UNUSED-PWD                PIC X(08).
         05 UNUSED-TYPE               PIC X(01).
         05 UNUSED-FILLER             PIC X(23).
      *
      * Ver: CardDemo_v1.0-56-gd8e5ebf-109 Date: 2022-08-19 17:55:18 CDT
      *
